{
  "blogs": [
    {
      "id": "1",
      "title": "How to Manage JavaScript Fatigue",
      "description": "Many developers are overwhelmed by the rapidly expanding ecosystem of modern JavaScript. Learn how to manage and mitigate JS fatigue.",
      "img": "/frankeinstein.jpeg"
    },
    {
      "id": "2",
      "title": "How to Use Next.js 14’s Server Components Effectively",
      "description": "It’s not uncommon to discover a snippet of wisdom that challenges our established practices and nudges us towards introspection. This was precisely my experience when a seemingly innocuous comment on Reddit sparked a profound reevaluation of my approach to using Next.js 14. The comment, simple yet profound, suggested: “with Next.js 14, you don’t need to use useState as much.”",
      "img": "/sevmezamani.png",
      "video": "https://www.youtube.com/embed/tgbNymZ7vqY"
    },
    {
      "id": "3",
      "title": "Mükemmeliyetle özgünlük mümkün değil: Kit Sebastian",
      "description": "Geçmişle günümüzü psikedelik pop filtresinden geçirerek buluşturan Londralı ikili Kit Sebastian, şimdilerde yeni bir heyecan yaşıyor. Flying Lotus’un kurucusu olduğu plak şirketi Brainfeeder ile anlaşan ve bu etiketle ilk teklisini yayımlayan Kit Martin – Merve Erdem ikilisi, ilham yelpazesini genişletmeye tam gaz devam ediyor.",
      "img": "/bergman.png"
    },
    {
      "id": "4",
      "title": "Choosing the State Structure",
      "description": "Structuring state well can make a difference between a component that is pleasant to modify and debug, and one that is a constant source of bugs. Here are some tips you should consider when structuring state.",
      "img": "/pulp.jpg"
    },
    {
      "id": "5",
      "title": "Server and Client Components",
      "description": "Each environment has its own set of capabilities and constraints. For example, by moving rendering and data fetching to the server, you can reduce the amount of code sent to the client, which can improve your application's performance. But, as you learned earlier, to make your UI interactive, you need to update the DOM on the client.",
      "img": "/sevmezamani.png"
    },
    {
      "id": "6",
      "title": "How to Manage JavaScript Fatigue",
      "description": "Many developers are overwhelmed by the rapidly expanding ecosystem of modern JavaScript. Learn how to manage and mitigate JS fatigue.",
      "img": "/frankeinstein.jpeg"
    },
    {
      "id": "7",
      "title": "How to Manage JavaScript Fatigue",
      "description": "Many developers are overwhelmed by the rapidly expanding ecosystem of modern JavaScript. Learn how to manage and mitigate JS fatigue.",
      "img": "/frankeinstein.jpeg"
    },
    {
      "id": "8",
      "title": "How to Manage JavaScript Fatigue",
      "description": "Many developers are overwhelmed by the rapidly expanding ecosystem of modern JavaScript. Learn how to manage and mitigate JS fatigue.",
      "img": "/frankeinstein.jpeg"
    },
    {
      "id": "9",
      "title": "How to Manage JavaScript Fatigue",
      "description": "Many developers are overwhelmed by the rapidly expanding ecosystem of modern JavaScript. Learn how to manage and mitigate JS fatigue.",
      "img": "/frankeinstein.jpeg"
    },
    {
      "id": "10",
      "title": "How to Manage JavaScript Fatigue",
      "description": "Many developers are overwhelmed by the rapidly expanding ecosystem of modern JavaScript. Learn how to manage and mitigate JS fatigue.",
      "img": "/frankeinstein.jpeg"
    },
    {
      "id": "11",
      "title": "How to Manage JavaScript Fatigue",
      "description": "Many developers are overwhelmed by the rapidly expanding ecosystem of modern JavaScript. Learn how to manage and mitigate JS fatigue.",
      "img": "/frankeinstein.jpeg"
    },
    {
      "id": "12",
      "title": "How to Manage JavaScript Fatigue",
      "description": "Many developers are overwhelmed by the rapidly expanding ecosystem of modern JavaScript. Learn how to manage and mitigate JS fatigue.",
      "img": "/frankeinstein.jpeg"
    },
    {
      "id": "13",
      "title": "How to Manage JavaScript Fatigue",
      "description": "Many developers are overwhelmed by the rapidly expanding ecosystem of modern JavaScript. Learn how to manage and mitigate JS fatigue.",
      "img": "/frankeinstein.jpeg"
    },
    {
      "id": "14",
      "title": "How to Manage JavaScript Fatigue",
      "description": "Many developers are overwhelmed by the rapidly expanding ecosystem of modern JavaScript. Learn how to manage and mitigate JS fatigue.",
      "img": "/frankeinstein.jpeg"
    },
    {
      "id": "15",
      "title": "How to Manage JavaScript Fatigue",
      "description": "Many developers are overwhelmed by the rapidly expanding ecosystem of modern JavaScript. Learn how to manage and mitigate JS fatigue.",
      "img": "/frankeinstein.jpeg"
    },
    {
      "id": "16",
      "title": "Sümbül Hanım",
      "description": "Sümbül hanım dokuz yıllık evli ve çocuksuzdu.",
      "content": "Sümbül hanım dokuz yıllık evli ve çocuksuzdu.\nSümbül Hanım, Bayan Sümbül' dü de. Hanım! Kimin hanımıyım ben!\nKimin hanı! Oysa bayan! \" Ah bayan!\" derdi kendi kendine.\nMemduh bey, Sümbül Hanım'ın eşi, \"Memduh Bey! Memduh Bey!\" diye\ncıvıldardı Sümbül Hanım. Memduh Beyi bazen annesi ve kardeşiyle\nkarıştırırdı ama, 'Memduh Bey' derdi gene de ona.\nMemduh Bey, bazı akşamlar gelmese Sümbül Hanım öleceğini sanırdı.\nMemduh Bey, akşam gagasında bir solucanla gelecek ve onu ölmekten\nkurtaracaktı.\n\nEvliliklerinin ilk yıllarında Sümbül Hanım da bir süre çalışmış, Memduh\nBey buna gerek olmadığını söyleyince de bırakmıştı; yedi yıldır evdeydi.\nBir vakit eş dost edinmek iyi gelir diye sokağa çıkmaya, cemiyete\nkarışmaya kalkmış, fakat karşılaştığı kadın ve erkeklerin, içinde güç,\nkuvvet, azim ve bağımsızlık geçen cümleleri Sümbül Hanım'a sinek\nvızıltısı gibi gelmiş, vücudu sinek ısırıklarıyla dolmuştu. Sümbül Hanım\nince bileklerine bakarak kime karşı güçlü, ne için azimli ve neden\nbağımsız olacağını düşünüp, dışarda insanlarla vakit geçirmenin yorucu\nve boşuna olduğuna karar vererek hemen evine dönmüştü. Sinekler eve\ndolmasın diye günlerce kapıyı açmamış, sonra Memduh Bey'in , \"\nKonuşan sinekler buraya gelmez Sümbül Hanım, bak böyle yaparsan\nkuşlarımız aç kalacak, balkona çıkıp onları beslemek gerek, bunun içinde\nkapıyı açmak gerek, di mi ama, bak sana mısır getirdim, kuşlarda yer,\nhadi balkonun kapısını açalım da kuşlara mısır verelim,\" diye ince ince\nkonuşmasıyla ikna olup pır dönmeyi kesmiş ve ayak uçlarına basa basa\ngidip balkonun kapısını Memduh Bey'le açmıştı.\n\nMemduh bey arada sırada çiçek de getirirdi Sümbül Hanım'a. Fakat\nSümbül Hanım papatyaları bile gösterişli bulduğundan Memduh Bey,\nSümbül Hanım'a sümbül getirmeye başlamıştı. Sümbül Hanım\n\nsümbülleri neşeyle karşılamış, \" İşte çiçekleri yaprakları küçücük ve\nsayılamayacak kadar çok, gösterişsiz mor menekşe renk!\" diye\ncıvıldayarak çiçekleri özenle vazoya koymuş, menekşi ışıklı odasına\ngötürmüştü. Sümbül Hanım odasına 'menekşi' derdi.\nSümbül Hanım'ın gül kurusu perdeleri her daim kapalı, tüyler tüllerle\nkaplı, menekşe ışıklı odası, adeta bir kuş yuvasıydı. Sümbül Hanım\nkuşların terasa saçılan her tüyünü toplardı. Bu yaptığını hiç yazmaz ve\nbunu düşünmezdi.\nSümbül hanım, Memduh Bey'in kendisi için aldığı şeyleri, 'bu yıl neler\nyaptım' defterindeki yaptığı işler listesine sıralardı. Memduh Bey'den bir\nşey almak onun için bir işti.\n\"Bu yıl otuz sekiz defa sümbül aldım, on beşi mor, onu beyaz, onu\npembeydi.\"\nSümbül Hanım için sevinmek, özlemek ve anlamak da bir işti. Memduh\nbey ona sümbül, bir kavanoz bal, yüz gram fıstk, yüz gram badem\nalmışsa Memduh Beye sarılıyor, nerdeyse boynuna asılıyor, üzerindeki\ntül- dantel-kuştüyü eşarplardan giysileriyle büyük yuvasının içindeki\nküçük yuvasına gidiyor, defterini açıyor, tarihe bakıyor, 'bu yıl neler\nyaptım' defterine yaptıklarını yazıyordu:\n\"Memduh Bey'in getirdiği yüz gram bademi teker teker yedim, bu defa\nyüz gram bademden elli badem çıktı, sonra Memduh Bey kapımı çaldı ve\nbana sigara içebilir miyiz dedi, Memduh Bey'i odamda kabul ettim, ona\nverdiğim sandalyede oturdu, ben pufumda oturdum, bu yıl ilk defa sigara\niçtim ve Memduh beyi odamda ağırladım.\"\nSümbül Hanım günün sonunda takvimden yaprak koparıyor, takvim\nyaprağından tarihi okuyup sayfanın en üstüne, ortaya, başlık gibi\nyazıyordu.\n29 MAYIS\n\"Bugün Bayan Sümbül oturmuş ve birikmiş takvim yapraklarını\nsaymıştır, tam yüz yirmi yaprak saymıştır, duvardan takvimi indirmiş ve\nbirikecek takvim yapraklarını saymış, iki yüz kırk takvim yaprağı takvimde\nkalmıştır.\"\n\nSümbül Hanım'ın sık yaptığı işlerden biri de kendinin ve Memduh Bey'in\nyaşını hesaplamaktı.\n\"Bugün Bayan Sümbül otuz dokuz, Memduh bey kırk dört yaşındadır.\nBayan Sümbül ve Memduh bey aynaya hiç bakmamaktadırlar.\"\nAynaya bakıp acaba gerçekten otuz dokuz yaşında mıyım diye düşünür\nve bu yaptığına, yani aynaya bakıp yaşını anlama işine 'ayna testi' derdi\nSümbül Hanım.\nSümbül Hanım pazara çıkmayı severdi, pazardan genelde domates\nalırdı, ama bütün pazarı dolaşırdı. Pazarda bazı satıcılar ona 'bayan'\nderdi.\nBayan olmak güzeldi,ama Pazar yoktu o gün, pencereden baktı, sokak\nbomboştu.'Ben Bayan Sümbül' diyemeyecekti. Memduh beyi\nbekleyecekti. Akşam saat sekizde birden, 'Bayım, affedersiniz bayım,\npardon bayım, bir şey sorabilir miyim' diyecekti, 'Bay Memduh, bana\nbalıkları gösterir misiniz' diyecekti.\nBayan Sümbül yılda ancak on iki defa yemek yapardı. Her defasında\n'bu yıl neler yaptım' defterine yazdığı için biliyordu ve her şeyin sayısı\ndeğişirken bunun hep on iki çıkmasına şaşırıyordu. Tabii yaptığı\nyemekleri yemezdi, çünkü yemek yemezdi. Domates ve Memduh Bey'in\naldığı birkaç çeşit kuruyemişle incirdi onun gıdası. Bir gün domates, bir\ngün badem, bir gün incir, bir gün fındık, bir gün bal… Asla tek günde iki\nşey yemezdi. Memduh bey ona birkaç haftada bir bal alır, eğer Sümbül\nHanım yemeyi unutmazsa, bir kavanoz bal ona günde üç kaşıktan on\nbeş gün yeterdi. Sümbül Hanım bir damla bile alkol içemezdi, onun\nkuşkonmazlara konabilen bedeni için birazcık içki, kuruması demekti.\nMemduh Bey'le pavyona gittiklerinde Memduh beyin söylediği rakıya elini\nbile sürmez, başını kadehe doğru hafifçe eğer, koklar, ama her seferinde\nkoklar ve memnuniyetsiz bir edayla kafasını kaldırırdı. Eğer bir şeyler\nyemişse bunu da defterine muhakkak yazardı.\n\"Bu yıl sekiz defa incir yenmiştir.\"\nYıl sonunda Bay Memduh yeni takvimle eve geldiğinde, eğer eski\ntakvimde hala yaprak kalmışsa, Bayan Sümbül kalan günlerin niye\ngelmeden geçtiğini düşünürdü. Bazen de tam tersi olur, takvimin\nyaprakları yıl bitmeden biter, Sümbül Hanım günlerin neden\n\nkaybolduğunu düşünür ve Memduh Bey'e \"Bu sene bitti Memduh Bey,\nrica etsem bana yeni takvim alır mısınız,\" derdi, yaprakların nereye\ngitmiş olduğunu dalgın dalgın düşünerek. Böyle zamanlarda, Memduh\nBey, \"Bu yıl çok hızlısınız sümbül hanım, birkaç gün beklerseniz size yeni\ntakvim alırım,\" der ve alırdı. Sümbül hanım yeni takvimi alınca 'bu yıl\nneler yaptım' defterini açıp, yıl sonu özetini sesli sesli okurdu, Memduh\nBey de neden kendisine okunduğunu anlamadığı halde dinlerdi. Oysa\nbu, yılın son işiydi.\nMesela geçen yıl on iki defa yemek, otuz altı defa genel temizlik\nyapmış, kırk dört defa pazara gitmiş, on üç defa kendisinin ve Memduh\nBey'in yaşını hesaplamış, bu hesapların yedisinde kendisini ve Memduh\nBey'i ayna testine sokmuş, Bay Memduh'la üç defa pavyona gitmiş,\nilkinde üç, diğer ikisinde iki saat oturmuş, pavyona gidip dönerken\ntaksiye binmiş, pazardaki birinci domates aldığı adam ona beş defa 'abla'\ndemiş, ikinci domates aldığı adam sekiz defa 'bayan', üçüncü domates\naldığı ilk üç defa 'bayan', son beş defa 'abla', dördüncü domates aldığı\nadam beş defa 'Sümbül Hanım' demiş, son seferinde adını söylediğini\nfark ettiği için bu adama gitmemiş, ona gitmeme kararı almış ve sonraki\nhaftalarda da dördüncü domates satan adamdan domates almamış…\nSümbülün bu haftalarda hangi domates satan adamdan domates\naldığını bilmiyoruz, bu pazara gitmelerin esas ayrıntısı, dördüncü\ndomates satan adamdan domates almamış olmasıydı.\nBir haziran gününü tam otuz gün boyu 'bir haziran günü' adıyla deftere\ntekrar tekrar yazmıştı.\nBİR HAZİRAN GÜNÜ\n\"Bugün pazarda dördüncü domates satan adama bakılmadan önünden\ngeçilmiş, ilk defa İzmir üzümü alınmış, İzmir üzümü satan adamla küçük\nbir münakaşa edilmiştir. Olay şöyle olmuştur: izmir üzümü alınan adama\nbir salkım üzüm denince, adam, abla bunu bir kilo yapayım demiş,\nadama, rica ederim ben abla değilim, denince,adam,peki bayan peki\nbayan, demiş,bayan derken adamın yüzünde dördüncü domates satan\nadamın yüzündekine benzer bir gülümseme görülmüş ve bu ifadeden\nürkülmüş, büyük bir kabalık yapılarak, sağ olunuz, denmeden üzüm\nalınmış, bu yüzden çamaşırcıya uğranmadan eve gelinmiştir. Üzüm\nmutfak tezgahında iki saat beklemiş, Bayan Sümbül çözemediği o\n\nifadeden ötürü ağlamıştır. Sonra dayanılamayıp Bay Memduh'un\nodasına gidilmiş, bu da bu yıl ilk defa yapılmış, bay Memduhun balıkları\nizlenmiştir; fakat bu balıklar Bayan Sümbülün kederini alamayınca Bayan\nsümbül televizyondaki balıkları görmek istemiş ne yazık ki televizyonu\naçmayı becerememiştir. Televizyondaki rengarenk balıkların yuvalarını\ngöremediği için, bayan sümbül daha da ağlamıştır. Bayan sümbül\ngerçeği itiraf etmelidir ki televizyondaki balıkları çok ama çok özlemiştir.\nBalıkların rengarenk kayalarını, bitkilerini, mercanlarını görmeyi daha da\nçok özlemiştir. Televizyonu açamadığını gören ve balıkları özlediğini itiraf\neden Bayan Sümbül, Memduh beyin odasını incelemiş ve burayı\nneredeyse unuttuğunu anlamıştır. Unuttuğunu anlaması Bayan Sümbülü\ndurultmuş ve doğru mutfağa gidip üzümü yıkamıştır. Üzüm yıkandıktan\nsonra teneleri tek tek koparılmış, sayılmış ve iki kaseye eşit dağıtılmıştır.\nBu gece bay memduha gidilecek ve üzüm götürülecektir. Bir salkım\nüzümden iki yüz otuz üç üzüm çıkmıştır. Bayan sümbül otuz üç üzümün\nkuşların hakkı olduğunu düşünerek onları kuşlara atmıştır. Balkon çok pis\nbulunmuş, fakat madem bu kadar pis, demek ki temizlenme vakti\ngelmiş, gelmiş olsaydı, temizlenmiş olurdu nasılsa, denerek içeri\ngirilmiştir.\nGÜNÜN ÖZETİ:\nBALKON KİRLİ BULUNMUŞ\nBALIKLAR VE ONLARIN EVLERİ ÖZLENMİŞ\nAĞLANMIŞTIR…\nNitekim Sümbül Hanım, yıl sonu özetine bunları da madde madde\nyazmıştı:\n\"1.Ağladım.\n2.Balıkları özledim\n3.Anladım\n4.Özledim\n5.Özlediğimi anladım.\"\n\nDerken,bir gece Memduh bey gelmedi.\n\nBayan Sümbül de ölmedi.",
      "img": "/frankeinstein.jpeg"
    }
  ]
}
